### Create language texts
lang_dict = {'RUS': {
                     ### add row block 
                     'hebrew': 'введите слово на иврите: ',                     
                     'translation': 'введите перевод: ',                     
                     'translitiration': 'введите транслитерацию: ',
                     'genus': 'введите род (муж, жен): ',
                     'genus_list': ['муж', 'жен'],
                     'type': 'введите часть речи (сущ, глаг, мест, прилаг, нареч, вопрос, союз): ',
                     'type_list': ['сущ', 'глаг', 'мест', 'прилаг',
                                   'нареч', 'вопрос', 'союз', 'доп'],
                     'plural': 'введите число (мн, ед): ',
                     'plural_list': ['мн', 'ед'],
                     'genus_list': ['муж', 'жен'],
                     'type_error': 'нет такой части речи',
                     'genus_error': 'нет такого рода',
                     'plural_error': 'нет такого числа',
                     'finish_add': 'закончили',
                     'check_add': 'проверяем: ',
                     'dupl_err_txt': ['слово есть в словаре']  
                     }}

lang_dict_check = {'RUS': {
                           ### check knowledge
                           'transl_word': 'переведите слово: ',
                           'write_word': 'напишите слово: ',
                           'good': 'Верно!',
                           'bad': 'Неверно.',
                           }}

lang_noun = {'RUS': {'lang_sl': 'един. число: ',                     
                     'lang_pl': 'мн. число: ',
                     'trns_sl': 'перевод: ',                     
                     'trns_pl': 'перевод: ',                     
                     'trnsl_sl': 'транслитерация: ',
                     'trnsl_pl': 'транслитерация: ',
                     'genus': 'род: ',                                                                                       
                     }}

lang_verb = {'RUS': {'lang_inf': 'инфинитив: ',                     
                     'lang_sl_m': 'един. муж.: ',                     
                     'lang_pl_m': 'мн. муж.: ',
                     'lang_sl_w': 'един. жен.: ',
                     'lang_pl_w': 'мн. жен.: ',
                     'trns_inf': 'перевод: ',                         
                     'trnsl_inf': 'транслитерация: ',
                     'trnsl_sl_m': 'транслитерация: ',
                     'trnsl_pl_m': 'транслитерация: ',
                     'trnsl_sl_w': 'транслитерация: ',
                     'trnsl_pl_w': 'транслитерация: ',                                                                                              
                     }}
lang_full = {'RUS': {'lang_inf': 'Безличн.: ',
                     'trns_inf': 'перевод: ',
                     'trnsl_inf': 'транслитерация: ',
                     
                     'lang_1_sl': '1 лицо един.: ',                     
                     'lang_1_pl': '1 лицо мн.: ',
                     'lang_2_sl_m': '2 лицо един. м: ',                     
                     'lang_2_sl_w': '2 лицо един. ж: ',                     
                     'lang_2_pl_m': '2 лицо мн. м: ',                     
                     'lang_2_pl_w': '2 лицо мн. ж: ',                     
                     'lang_3_sl_m': '3 лицо един. м: ',                     
                     'lang_3_sl_w': '3 лицо един. ж: ',                     
                     'lang_3_pl_m': '3 лицо мн. м: ',                     
                     'lang_3_pl_w': '3 лицо мн. ж: ',                     
                     
                     'trnsl_1_sl': 'транслитерация: ',
                     'trnsl_1_pl': 'транслитерация: ',
                     'trnsl_2_sl_m': 'транслитерация: ',
                     'trnsl_2_sl_w': 'транслитерация: ',
                     'trnsl_2_pl_m': 'транслитерация: ',
                     'trnsl_2_pl_w': 'транслитерация: ',
                     'trnsl_3_sl_m': 'транслитерация: ',
                     'trnsl_3_sl_w': 'транслитерация: ',
                     'trnsl_3_pl_m': 'транслитерация: ',
                     'trnsl_3_pl_w': 'транслитерация: ',
                     
                     'trns_1_sl': 'перевод: ',
                     'trns_1_pl': 'перевод: ',
                     'trns_2_sl_m': 'перевод: ',
                     'trns_2_sl_w': 'перевод: ',
                     'trns_2_pl_m': 'перевод: ',
                     'trns_2_pl_w': 'перевод: ',
                     'trns_3_sl_m': 'перевод: ',
                     'trns_3_sl_w': 'перевод: ',
                     'trns_3_pl_m': 'перевод: ',
                     'trns_3_pl_w': 'перевод: ',
                     
                     }}
