### Create language texts
lang_dict = {'RUS': {
                     ### add row block 
                     'hebrew': 'введите слово на иврите: ',                     
                     'translation': 'введите перевод: ',                     
                     'translitiration': 'введите транслитерацию: ',
                     'genus': 'введите род (муж, жен): ',
                     'genus_list': ['муж', 'жен'],
                     'type': 'введите часть речи (сущ, глаг, мест, прилаг, нареч, вопрос, союз): ',
                     'type_list': ['сущ', 'глаг', 'мест', 'прилаг',
                                   'нареч', 'вопрос', 'союз', 'доп'],
                     'plural': 'введите число (мн, ед): ',
                     'plural_list': ['мн', 'ед'],
                     'genus_list': ['муж', 'жен'],
                     'type_error': 'нет такой части речи',
                     'genus_error': 'нет такого рода',
                     'plural_error': 'нет такого числа',
                     'finish_add': 'закончили',
                     'check_add': 'проверяем: ',
                     'dupl_err_txt': ['слово ', ' есть в словаре']  
                     }}

lang_dict_check = {'RUS': {
                           ### check knowledge
                           'transl_word': 'переведите слово: ',
                           }}

lang_noun = {'RUS': {'lang_m_sl': 'муж. род/един. число: ',
                     'lang_w_sl': 'муж. род/мн. число: ',
                     'lang_m_pl': 'жен. род/един. число: ',
                     'lang_w_pl': 'жен. род/мн. число: ',
                     'trns_m_sl': 'перевод: ',
                     'trns_w_sl': 'перевод: ',
                     'trns_m_pl': 'перевод: ',
                     'trns_w_pl': 'перевод: ',
                     'trnsl_m_sl': 'транслитерация: ',
                     'trnsl_w_sl': 'транслитерация: ',
                     'trnsl_m_pl': 'транслитерация: ',
                     'trnsl_w_pl': 'транслитерация: ',                                                                                       
                     }}
